In [14]:
import pandas as pd
import numpy as np

In [15]:
df= pd.DataFrame({"name" :["harsh" , "Varun","harsh" , "Varun",np.nan] , "marks" :[34,56,np.nan,78,43]})

In [16]:
df

    name  marks
0  harsh   34.0
1  Varun   56.0
2  harsh    NaN
3  Varun   78.0
4    NaN   43.0

In [19]:
df.groupby('name').sum().reset_index()

    name  marks
0  Varun  134.0
1  harsh   34.0

In [27]:
df.groupby('name',dropna=False).sum().reset_index() 
#similarly we can apply mean , mod , median etc

    name  marks
0  Varun  134.0
1  harsh   34.0
2    NaN   43.0

In [28]:
a=df.groupby('name')[['marks']].apply(lambda x : x*2)

In [29]:
a

         marks
name
Varun 1  112.0
      3  156.0
harsh 0   68.0
      2    NaN

**AGGREGATE**

In [31]:
df= pd.DataFrame({"name" :["harsh" , "Varun","harsh" , "Varun",np.nan] , "marks" :[34,56,np.nan,78,43]})

In [32]:
df

    name  marks
0  harsh   34.0
1  Varun   56.0
2  harsh    NaN
3  Varun   78.0
4    NaN   43.0

In [37]:
df.groupby('name').agg(['sum','mean'])

       marks
         sum  mean
name
Varun  134.0  67.0
harsh   34.0  34.0

In [38]:
df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",

                         "bar", "bar", "bar", "bar"],

                   "B": ["one", "one", "one", "two", "two",

                         "one", "one", "two", "two"],

                   "C": ["small", "large", "large", "small",

                         "small", "large", "small", "small",

                         "large"],

                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],

                   "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})

In [39]:
df

     A    B      C  D  E
0  foo  one  small  1  2
1  foo  one  large  2  4
2  foo  one  large  2  5
3  foo  two  small  3  5
4  foo  two  small  3  6
5  bar  one  large  4  6
6  bar  one  small  5  8
7  bar  two  small  6  9
8  bar  two  large  7  9

In [48]:
df.pivot_table( values='E', index=['A'], columns=['C'],aggfunc="sum")

C    large  small
A
bar     15     17
foo      9     13